apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_dcm.h
/****************************************************************************
 * arch/arm/src/s32k3xx/hardware/s32k3xx_dcm.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* Copyright 2022 NXP */

#ifndef __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_DCM_H
#define __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_DCM_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <hardware/s32k3xx_memorymap.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* DCM Register Offsets *****************************************************/

#define S32K3XX_DCM_DCMSTAT_OFFSET      (0x0000) /* DCM Status (DCMSTAT) */
#define S32K3XX_DCM_DCMLCC_OFFSET       (0x0004) /* LC and LC Control (DCMLCC) */
#define S32K3XX_DCM_DCMLCS_OFFSET       (0x0008) /* LC Scan Status (DCMLCS) */
#define S32K3XX_DCM_DCMMISC_OFFSET      (0x001c) /* DCM Miscellaneous (DCMMISC) */
#define S32K3XX_DCM_DCMDEB_OFFSET       (0x0020) /* Debug Status and Configuration (DCMDEB) */
#define S32K3XX_DCM_DCMEC_OFFSET        (0x002c) /* DCF Error Count (DCMEC) */
#define S32K3XX_DCM_DCMSRR1_OFFSET      (0x0030) /* DCF Scan Report 1 (DCMSRR1) */
#define S32K3XX_DCM_DCMSRR2_OFFSET      (0x0034) /* DCF Scan Report 2 (DCMSRR2) */
#define S32K3XX_DCM_DCMSRR3_OFFSET      (0x0038) /* DCF Scan Report 3 (DCMSRR3) */
#define S32K3XX_DCM_DCMSRR4_OFFSET      (0x003c) /* DCF Scan Report 4 (DCMSRR4) */
#define S32K3XX_DCM_DCMSRR5_OFFSET      (0x0040) /* DCF Scan Report 5 (DCMSRR5) */
#define S32K3XX_DCM_DCMSRR6_OFFSET      (0x0044) /* DCF Scan Report 6 (DCMSRR6) */
#define S32K3XX_DCM_DCMSRR7_OFFSET      (0x0048) /* DCF Scan Report 7 (DCMSRR7) */
#define S32K3XX_DCM_DCMSRR8_OFFSET      (0x004c) /* DCF Scan Report 8 (DCMSRR8) */
#define S32K3XX_DCM_DCMSRR9_OFFSET      (0x0050) /* DCF Scan Report 9 (DCMSRR9) */
#define S32K3XX_DCM_DCMSRR10_OFFSET     (0x0054) /* DCF Scan Report 10 (DCMSRR10) */
#define S32K3XX_DCM_DCMSRR11_OFFSET     (0x0058) /* DCF Scan Report 11 (DCMSRR11) */
#define S32K3XX_DCM_DCMSRR12_OFFSET     (0x005c) /* DCF Scan Report 12 (DCMSRR12) */
#define S32K3XX_DCM_DCMSRR13_OFFSET     (0x0060) /* DCF Scan Report 13 (DCMSRR13) */
#define S32K3XX_DCM_DCMSRR14_OFFSET     (0x0064) /* DCF Scan Report 14 (DCMSRR14) */
#define S32K3XX_DCM_DCMSRR15_OFFSET     (0x0068) /* DCF Scan Report 15 (DCMSRR15) */
#define S32K3XX_DCM_DCMSRR16_OFFSET     (0x006c) /* DCF Scan Report 16 (DCMSRR16) */
#define S32K3XX_DCM_DCMLCS2_OFFSET      (0x0080) /* LC Scan Status 2 (DCMLCS2) */
#define S32K3XX_DCM_GPR_DCMROD1_OFFSET  (0x0200) /* Read Only GPR On Destructive Reset Register 1 (DCMROD1) */
#define S32K3XX_DCM_GPR_DCMROD3_OFFSET  (0x0208) /* Read Only GPR On Destructive Reset Register 3 (DCMROD3) */
#define S32K3XX_DCM_GPR_DCMROD4_OFFSET  (0x020c) /* Read Only GPR On Destructive Reset Register 4 (DCMROD4) */
#define S32K3XX_DCM_GPR_DCMROD5_OFFSET  (0x0210) /* Read Only GPR On Destructive Reset Register 5 (DCMROD5) */
#define S32K3XX_DCM_GPR_DCMROF1_OFFSET  (0x0300) /* Read Only GPR On Functional Reset Register 1 (DCMROF1) */
#define S32K3XX_DCM_GPR_DCMROF2_OFFSET  (0x0304) /* Read Only GPR On Functional Reset Register 2 (DCMROF2) */
#define S32K3XX_DCM_GPR_DCMROF3_OFFSET  (0x0308) /* Read Only GPR On Functional Reset Register 3 (DCMROF3) */
#define S32K3XX_DCM_GPR_DCMROF4_OFFSET  (0x030c) /* Read Only GPR On Functional Reset Register 4 (DCMROF4) */
#define S32K3XX_DCM_GPR_DCMROF5_OFFSET  (0x0310) /* Read Only GPR On Functional Reset Register 5 (DCMROF5) */
#define S32K3XX_DCM_GPR_DCMROF6_OFFSET  (0x0314) /* Read Only GPR On Functional Reset Register 6 (DCMROF6) */
#define S32K3XX_DCM_GPR_DCMROF7_OFFSET  (0x0318) /* Read Only GPR On Functional Reset Register 7 (DCMROF7) */
#define S32K3XX_DCM_GPR_DCMROF8_OFFSET  (0x031c) /* Read Only GPR On Functional Reset Register 8 (DCMROF8) */
#define S32K3XX_DCM_GPR_DCMROF9_OFFSET  (0x0320) /* Read Only GPR On Functional Reset Register 9 (DCMROF9) */
#define S32K3XX_DCM_GPR_DCMROF10_OFFSET (0x0324) /* Read Only GPR On Functional Reset Register 10 (DCMROF10) */
#define S32K3XX_DCM_GPR_DCMROF11_OFFSET (0x0328) /* Read Only GPR On Functional Reset Register 11 (DCMROF11) */
#define S32K3XX_DCM_GPR_DCMROF12_OFFSET (0x032c) /* Read Only GPR On Functional Reset Register 12 (DCMROF12) */
#define S32K3XX_DCM_GPR_DCMROF13_OFFSET (0x0330) /* Read Only GPR On Functional Reset Register 13 (DCMROF13) */
#define S32K3XX_DCM_GPR_DCMROF14_OFFSET (0x0334) /* Read Only GPR On Functional Reset Register 14 (DCMROF14) */
#define S32K3XX_DCM_GPR_DCMROF15_OFFSET (0x0338) /* Read Only GPR On Functional Reset Register 15 (DCMROF15) */
#define S32K3XX_DCM_GPR_DCMROF16_OFFSET (0x033c) /* Read Only GPR On Functional Reset Register 16 (DCMROF16) */
#define S32K3XX_DCM_GPR_DCMROF17_OFFSET (0x0340) /* Read Only GPR On Functional Reset Register 17 (DCMROF17) */
#define S32K3XX_DCM_GPR_DCMROF19_OFFSET (0x0348) /* Read Only GPR On Functional Reset Register 19 (DCMROF19) */
#define S32K3XX_DCM_GPR_DCMROF20_OFFSET (0x034c) /* Read Only GPR On Functional Reset Register 20 (DCMROF20) */
#define S32K3XX_DCM_GPR_DCMROF21_OFFSET (0x0350) /* Read Only GPR On Functional Reset Register 21 (DCMROF21) */
#define S32K3XX_DCM_GPR_DCMRWP1_OFFSET  (0x0400) /* Read Write GPR On Power On Reset Register 1 (DCMRWP1) */
#define S32K3XX_DCM_GPR_DCMRWP3_OFFSET  (0x0408) /* Read Write GPR On Power On Reset Register 3 (DCMRWP3) */
#define S32K3XX_DCM_GPR_DCMRWD2_OFFSET  (0x0504) /* Read Write GPR On Destructive Reset Register 2 (DCMRWD2) */
#define S32K3XX_DCM_GPR_DCMRWD3_OFFSET  (0x0508) /* Read Write GPR On Destructive Reset Register 3 (DCMRWD3) */
#define S32K3XX_DCM_GPR_DCMRWD4_OFFSET  (0x050c) /* Read Write GPR On Destructive Reset Register 4 (DCMRWD4) */
#define S32K3XX_DCM_GPR_DCMRWD5_OFFSET  (0x0510) /* Read Write GPR On Destructive Reset Register 5 (DCMRWD5) */
#define S32K3XX_DCM_GPR_DCMRWD6_OFFSET  (0x0514) /* Read Write GPR On Destructive Reset Register 6 (DCMRWD6) */
#define S32K3XX_DCM_GPR_DCMRWD7_OFFSET  (0x0518) /* Read Write GPR On Destructive Reset Register 7 (DCMRWD7) */
#define S32K3XX_DCM_GPR_DCMRWD8_OFFSET  (0x051c) /* Read Write GPR On Destructive Reset Register 8 (DCMRWD8) */
#define S32K3XX_DCM_GPR_DCMRWD9_OFFSET  (0x0520) /* Read Write GPR On Destructive Reset Register 9 (DCMRWD9) */
#define S32K3XX_DCM_GPR_DCMRWF1_OFFSET  (0x0600) /* Read Write GPR On Functional Reset Register 1 (DCMRWF1) */
#define S32K3XX_DCM_GPR_DCMRWF2_OFFSET  (0x0604) /* Read Write GPR On Functional Reset Register 2 (DCMRWF2) */
#define S32K3XX_DCM_GPR_DCMRWF4_OFFSET  (0x060c) /* Read Write GPR On Functional Reset Register 4 (DCMRWF4) */
#define S32K3XX_DCM_GPR_DCMRWF5_OFFSET  (0x0610) /* Read Write GPR On Functional Reset Register 5 (DCMRWF5) */
#define S32K3XX_DCM_GPR_DCMROPP1_OFFSET (0x0700) /* Read Only GPR On PMCPOR Reset Register 1 (DCMROPP1) */
#define S32K3XX_DCM_GPR_DCMROPP2_OFFSET (0x0704) /* Read Only GPR On PMCPOR Reset Register 2 (DCMROPP2) */
#define S32K3XX_DCM_GPR_DCMROPP3_OFFSET (0x0708) /* Read Only GPR On PMCPOR Reset Register 3 (DCMROPP3) */
#define S32K3XX_DCM_GPR_DCMROPP4_OFFSET (0x070c) /* Read Only GPR On PMCPOR Reset Register 4 (DCMROPP4) */

/* DCM Register Addresses ***************************************************/

#define S32K3XX_DCM_DCMSTAT            (S32K3XX_DCM_BASE + S32K3XX_DCM_DCMSTAT_OFFSET)
#define S32K3XX_DCM_DCMLCC             (S32K3XX_DCM_BASE + S32K3XX_DCM_DCMLCC_OFFSET)
#define S32K3XX_DCM_DCMLCS             (S32K3XX_DCM_BASE + S32K3XX_DCM_DCMLCS_OFFSET)
#define S32K3XX_DCM_DCMMISC            (S32K3XX_DCM_BASE + S32K3XX_DCM_DCMMISC_OFFSET)
#define S32K3XX_DCM_DCMDEB             (S32K3XX_DCM_BASE + S32K3XX_DCM_DCMDEB_OFFSET)
#define S32K3XX_DCM_DCMEC              (S32K3XX_DCM_BASE + S32K3XX_DCM_DCMEC_OFFSET)
#define S32K3XX_DCM_DCMSRR1            (S32K3XX_DCM_BASE + S32K3XX_DCM_DCMSRR1_OFFSET)
#define S32K3XX_DCM_DCMSRR2            (S32K3XX_DCM_BASE + S32K3XX_DCM_DCMSRR2_OFFSET)
#define S32K3XX_DCM_DCMSRR3            (S32K3XX_DCM_BASE + S32K3XX_DCM_DCMSRR3_OFFSET)
#define S32K3XX_DCM_DCMSRR4            (S32K3XX_DCM_BASE + S32K3XX_DCM_DCMSRR4_OFFSET)
#define S32K3XX_DCM_DCMSRR5            (S32K3XX_DCM_BASE + S32K3XX_DCM_DCMSRR5_OFFSET)
#define S32K3XX_DCM_DCMSRR6            (S32K3XX_DCM_BASE + S32K3XX_DCM_DCMSRR6_OFFSET)
#define S32K3XX_DCM_DCMSRR7            (S32K3XX_DCM_BASE + S32K3XX_DCM_DCMSRR7_OFFSET)
#define S32K3XX_DCM_DCMSRR8            (S32K3XX_DCM_BASE + S32K3XX_DCM_DCMSRR8_OFFSET)
#define S32K3XX_DCM_DCMSRR9            (S32K3XX_DCM_BASE + S32K3XX_DCM_DCMSRR9_OFFSET)
#define S32K3XX_DCM_DCMSRR10           (S32K3XX_DCM_BASE + S32K3XX_DCM_DCMSRR10_OFFSET)
#define S32K3XX_DCM_DCMSRR11           (S32K3XX_DCM_BASE + S32K3XX_DCM_DCMSRR11_OFFSET)
#define S32K3XX_DCM_DCMSRR12           (S32K3XX_DCM_BASE + S32K3XX_DCM_DCMSRR12_OFFSET)
#define S32K3XX_DCM_DCMSRR13           (S32K3XX_DCM_BASE + S32K3XX_DCM_DCMSRR13_OFFSET)
#define S32K3XX_DCM_DCMSRR14           (S32K3XX_DCM_BASE + S32K3XX_DCM_DCMSRR14_OFFSET)
#define S32K3XX_DCM_DCMSRR15           (S32K3XX_DCM_BASE + S32K3XX_DCM_DCMSRR15_OFFSET)
#define S32K3XX_DCM_DCMSRR16           (S32K3XX_DCM_BASE + S32K3XX_DCM_DCMSRR16_OFFSET)
#define S32K3XX_DCM_DCMLCS2            (S32K3XX_DCM_BASE + S32K3XX_DCM_DCMLCS2_OFFSET)
#define S32K3XX_DCM_GPR_DCMROD1        (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMROD1_OFFSET)
#define S32K3XX_DCM_GPR_DCMROD3        (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMROD3_OFFSET)
#define S32K3XX_DCM_GPR_DCMROD4        (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMROD4_OFFSET)
#define S32K3XX_DCM_GPR_DCMROD5        (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMROD5_OFFSET)
#define S32K3XX_DCM_GPR_DCMROF1        (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMROF1_OFFSET)
#define S32K3XX_DCM_GPR_DCMROF2        (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMROF2_OFFSET)
#define S32K3XX_DCM_GPR_DCMROF3        (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMROF3_OFFSET)
#define S32K3XX_DCM_GPR_DCMROF4        (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMROF4_OFFSET)
#define S32K3XX_DCM_GPR_DCMROF5        (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMROF5_OFFSET)
#define S32K3XX_DCM_GPR_DCMROF6        (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMROF6_OFFSET)
#define S32K3XX_DCM_GPR_DCMROF7        (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMROF7_OFFSET)
#define S32K3XX_DCM_GPR_DCMROF8        (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMROF8_OFFSET)
#define S32K3XX_DCM_GPR_DCMROF9        (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMROF9_OFFSET)
#define S32K3XX_DCM_GPR_DCMROF10       (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMROF10_OFFSET)
#define S32K3XX_DCM_GPR_DCMROF11       (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMROF11_OFFSET)
#define S32K3XX_DCM_GPR_DCMROF12       (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMROF12_OFFSET)
#define S32K3XX_DCM_GPR_DCMROF13       (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMROF13_OFFSET)
#define S32K3XX_DCM_GPR_DCMROF14       (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMROF14_OFFSET)
#define S32K3XX_DCM_GPR_DCMROF15       (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMROF15_OFFSET)
#define S32K3XX_DCM_GPR_DCMROF16       (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMROF16_OFFSET)
#define S32K3XX_DCM_GPR_DCMROF17       (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMROF17_OFFSET)
#define S32K3XX_DCM_GPR_DCMROF19       (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMROF19_OFFSET)
#define S32K3XX_DCM_GPR_DCMROF20       (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMROF20_OFFSET)
#define S32K3XX_DCM_GPR_DCMROF21       (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMROF21_OFFSET)
#define S32K3XX_DCM_GPR_DCMRWP1        (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMRWP1_OFFSET)
#define S32K3XX_DCM_GPR_DCMRWP3        (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMRWP3_OFFSET)
#define S32K3XX_DCM_GPR_DCMRWD2        (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMRWD2_OFFSET)
#define S32K3XX_DCM_GPR_DCMRWD3        (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMRWD3_OFFSET)
#define S32K3XX_DCM_GPR_DCMRWD4        (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMRWD4_OFFSET)
#define S32K3XX_DCM_GPR_DCMRWD5        (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMRWD5_OFFSET)
#define S32K3XX_DCM_GPR_DCMRWD6        (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMRWD6_OFFSET)
#define S32K3XX_DCM_GPR_DCMRWD7        (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMRWD7_OFFSET)
#define S32K3XX_DCM_GPR_DCMRWD8        (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMRWD8_OFFSET)
#define S32K3XX_DCM_GPR_DCMRWD9        (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMRWD9_OFFSET)
#define S32K3XX_DCM_GPR_DCMRWF1        (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMRWF1_OFFSET)
#define S32K3XX_DCM_GPR_DCMRWF2        (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMRWF2_OFFSET)
#define S32K3XX_DCM_GPR_DCMRWF4        (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMRWF4_OFFSET)
#define S32K3XX_DCM_GPR_DCMRWF5        (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMRWF5_OFFSET)
#define S32K3XX_DCM_GPR_DCMROPP1       (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMROPP1_OFFSET)
#define S32K3XX_DCM_GPR_DCMROPP2       (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMROPP2_OFFSET)
#define S32K3XX_DCM_GPR_DCMROPP3       (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMROPP3_OFFSET)
#define S32K3XX_DCM_GPR_DCMROPP4       (S32K3XX_DCM_BASE + S32K3XX_DCM_GPR_DCMROPP4_OFFSET)

/* DCM Register Bitfield Definitions ****************************************/

