apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_dcm.h
/* DCM Status (DCMSTAT) */

#define DCM_DCMSTAT_DCMDONE            (1 << 0)  /* Bit 0: DCM Scanning Status (DCMDONE) */
#define DCM_DCMSTAT_DCMERR             (1 << 1)  /* Bit 1: DCM completion with error status (DCMERR) */
                                                 /* Bits 2-3: Reserved */
#define DCM_DCMSTAT_DCMLCST            (1 << 4)  /* Bit 4: LC Scanning Status (DCMLCST) */
                                                 /* Bits 5-7: Reserved */
#define DCM_DCMSTAT_DCMUTS             (1 << 8)  /* Bit 8: DCM UTEST DCF Scanning Status (DCMUTS) */
#define DCM_DCMSTAT_DCMOTAS            (1 << 9)  /* Bit 9: DCM OTA Scanning Status (DCMOTAS) */
#define DCM_DCMSTAT_DCMDBGPS           (1 << 10) /* Bit 10: Debug Password Scanning Status (DCMDBGPS) */
                                                 /* Bits 11-31: Reserved */

/* LC and LC Control (DCMLCC) */

#define DCM_DCMLCC_DCMCLC_SHIFT        (0)       /* Bits 0-2: Current LC (DCMCLC) */
#define DCM_DCMLCC_DCMCLC_MASK         (0x07 << DCM_DCMLCC_DCMCLC_SHIFT)
#define DCM_DCMLCC_DCMLCFN             (1 << 3)  /* Bit 3: Force LC (DCMLCFN) */
#define DCM_DCMLCC_DCMRLC_SHIFT        (0)       /* Bits 4-6: Real LC (DCMRLC) */
#define DCM_DCMLCC_DCMRLC_MASK         (0x07 << DCM_DCMLCC_DCMRLC_SHIFT)
                                                 /* Bit 7: Reserved */
#define DCM_DCMLCC_DCMFLC_SHIFT        (8)       /* Bits 8-9: Force Next LC (DCMFLC) */
#define DCM_DCMLCC_DCMFLC_MASK         (0x03 << DCM_DCMLCC_DCMFLC_SHIFT)
                                                 /* Bits 10-31: Reserved */

/* LC Scan Status (DCMLCS) */

#define DCM_DCMLCS_DCMLCSS1            (1 << 0)  /* Bit 0: MCU_PROD Scan Status (DCMLCSS1) */
#define DCM_DCMLCS_DCMLCC1_SHIFT       (1)       /* Bits 1-3: MCU_PROD Marking (DCMLCC1) */
#define DCM_DCMLCS_DCMLCC1_MASK        (0x07 << DCM_DCMLCS_DCMLCC1_SHIFT)
#  define DCM_DCMLCS_DCMLCC1_NOSCAN    (0x00 << DCM_DCMLCS_DCMLCC1_SHIFT) /* Not scanned yet */
#  define DCM_DCMLCS_DCMLCC1_ACTIVE    (0x01 << DCM_DCMLCS_DCMLCC1_SHIFT) /* Marked as active */
#  define DCM_DCMLCS_DCMLCC1_INACTIVE  (0x02 << DCM_DCMLCS_DCMLCC1_SHIFT) /* Marked as inactive */
#  define DCM_DCMLCS_DCMLCC1_ERASED    (0x03 << DCM_DCMLCS_DCMLCC1_SHIFT) /* Region is erased/virgin */
#  define DCM_DCMLCS_DCMLCC1_UNKNOWN   (0x05 << DCM_DCMLCS_DCMLCC1_SHIFT) /* Marked as inactive by an unknown pattern */
#  define DCM_DCMLCS_DCMLCC1_TIMEOUT   (0x06 << DCM_DCMLCS_DCMLCC1_SHIFT) /* Scanning timed out */

#define DCM_DCMLCS_DCMLCE1             (1 << 4)  /* Bit 4: MCU_PROD ECC Errors (DCMLCE1) */
#define DCM_DCMLCS_DCMLCFE1            (1 << 5)  /* Bit 5: MCU_PROD Flash Memory Error Check (DCMLCFE1) */
#define DCM_DCMLCS_DCMLCSS2            (1 << 6)  /* Bit 6: CUST_DEL Scan Status (DCMLCSS2) */
#define DCM_DCMLCS_DCMLCC2_SHIFT       (7)       /* Bits 7-9: CUST_DEL Marking (DCMLCC2) */
#define DCM_DCMLCS_DCMLCC2_MASK        (0x07 << DCM_DCMLCS_DCMLCC2_SHIFT)
#  define DCM_DCMLCS_DCMLCC2_NOSCAN    (0x00 << DCM_DCMLCS_DCMLCC2_SHIFT) /* Not scanned yet */
#  define DCM_DCMLCS_DCMLCC2_ACTIVE    (0x01 << DCM_DCMLCS_DCMLCC2_SHIFT) /* Marked as active */
#  define DCM_DCMLCS_DCMLCC2_INACTIVE  (0x02 << DCM_DCMLCS_DCMLCC2_SHIFT) /* Marked as inactive */
#  define DCM_DCMLCS_DCMLCC2_ERASED    (0x03 << DCM_DCMLCS_DCMLCC2_SHIFT) /* Region is erased/virgin */
#  define DCM_DCMLCS_DCMLCC2_UNKNOWN   (0x05 << DCM_DCMLCS_DCMLCC2_SHIFT) /* Marked as inactive by an unknown pattern */
#  define DCM_DCMLCS_DCMLCC2_TIMEOUT   (0x06 << DCM_DCMLCS_DCMLCC2_SHIFT) /* Scanning timed out */

#define DCM_DCMLCS_DCMLCE2             (1 << 10) /* Bit 10: CUST_DEL ECC Errors (DCMLCE2) */
#define DCM_DCMLCS_DCMLCFE2            (1 << 11) /* Bit 11: CUST_DEL Flash Memory Error Check (DCMLCFE2) */
#define DCM_DCMLCS_DCMLCSS3            (1 << 12) /* Bit 12: OEM_PROD Scan Status (DCMLCSS3) */
#define DCM_DCMLCS_DCMLCC3_SHIFT       (13)      /* Bits 13-15: OEM_PROD Marking (DCMLCC3) */
#define DCM_DCMLCS_DCMLCC3_MASK        (0x07 << DCM_DCMLCS_DCMLCC3_SHIFT)
#  define DCM_DCMLCS_DCMLCC3_NOSCAN    (0x00 << DCM_DCMLCS_DCMLCC3_SHIFT) /* Not scanned yet */
#  define DCM_DCMLCS_DCMLCC3_ACTIVE    (0x01 << DCM_DCMLCS_DCMLCC3_SHIFT) /* Marked as active */
#  define DCM_DCMLCS_DCMLCC3_INACTIVE  (0x02 << DCM_DCMLCS_DCMLCC3_SHIFT) /* Marked as inactive */
#  define DCM_DCMLCS_DCMLCC3_ERASED    (0x03 << DCM_DCMLCS_DCMLCC3_SHIFT) /* Region is erased/virgin */
#  define DCM_DCMLCS_DCMLCC3_UNKNOWN   (0x05 << DCM_DCMLCS_DCMLCC3_SHIFT) /* Marked as inactive by an unknown pattern */
#  define DCM_DCMLCS_DCMLCC3_TIMEOUT   (0x06 << DCM_DCMLCS_DCMLCC3_SHIFT) /* Scanning timed out */

#define DCM_DCMLCS_DCMLCE3             (1 << 16) /* Bit 16: OEM_PROD ECC Errors (DCMLCE3) */
#define DCM_DCMLCS_DCMLCFE3            (1 << 17) /* Bit 17: OEM_PROD Flash Memory Error Check (DCMLCFE3) */
#define DCM_DCMLCS_DCMLCSS4            (1 << 18) /* Bit 18: IN_FIELD Scan Status (DCMLCSS4) */
#define DCM_DCMLCS_DCMLCC4_SHIFT       (19)      /* Bits 19-21: IN_FIELD Marking (DCMLCC4) */
#define DCM_DCMLCS_DCMLCC4_MASK        (0x07 << DCM_DCMLCS_DCMLCC4_SHIFT)
#  define DCM_DCMLCS_DCMLCC4_NOSCAN    (0x00 << DCM_DCMLCS_DCMLCC4_SHIFT) /* Not scanned yet */
#  define DCM_DCMLCS_DCMLCC4_ACTIVE    (0x01 << DCM_DCMLCS_DCMLCC4_SHIFT) /* Marked as active */
#  define DCM_DCMLCS_DCMLCC4_INACTIVE  (0x02 << DCM_DCMLCS_DCMLCC4_SHIFT) /* Marked as inactive */
#  define DCM_DCMLCS_DCMLCC4_ERASED    (0x03 << DCM_DCMLCS_DCMLCC4_SHIFT) /* Region is erased/virgin */
#  define DCM_DCMLCS_DCMLCC4_UNKNOWN   (0x05 << DCM_DCMLCS_DCMLCC4_SHIFT) /* Marked as inactive by an unknown pattern */
#  define DCM_DCMLCS_DCMLCC4_TIMEOUT   (0x06 << DCM_DCMLCS_DCMLCC4_SHIFT) /* Scanning timed out */

#define DCM_DCMLCS_DCMLCE4             (1 << 22) /* Bit 22: IN_FIELD ECC Errors (DCMLCE4) */
#define DCM_DCMLCS_DCMLCFE4            (1 << 23) /* Bit 23: IN_FIELD Flash Memory Error Check (DCMLCFE4) */
#define DCM_DCMLCS_DCMLCSS5            (1 << 24) /* Bit 24: Pre-FA Scan Status (DCMLCSS5) */
#define DCM_DCMLCS_DCMLCC5_SHIFT       (25)      /* Bits 25-27: Pre-FA Marking (DCMLCC5) */
#define DCM_DCMLCS_DCMLCC5_MASK        (0x07 << DCM_DCMLCS_DCMLCC5_SHIFT)
#  define DCM_DCMLCS_DCMLCC5_NOSCAN    (0x00 << DCM_DCMLCS_DCMLCC5_SHIFT) /* Not scanned yet */
#  define DCM_DCMLCS_DCMLCC5_ACTIVE    (0x01 << DCM_DCMLCS_DCMLCC5_SHIFT) /* Marked as active */
#  define DCM_DCMLCS_DCMLCC5_INACTIVE  (0x02 << DCM_DCMLCS_DCMLCC5_SHIFT) /* Marked as inactive */
#  define DCM_DCMLCS_DCMLCC5_ERASED    (0x03 << DCM_DCMLCS_DCMLCC5_SHIFT) /* Region is erased/virgin */
#  define DCM_DCMLCS_DCMLCC5_UNKNOWN   (0x05 << DCM_DCMLCS_DCMLCC5_SHIFT) /* Marked as inactive by an unknown pattern */
#  define DCM_DCMLCS_DCMLCC5_TIMEOUT   (0x06 << DCM_DCMLCS_DCMLCC5_SHIFT) /* Scanning timed out */

#define DCM_DCMLCS_DCMLCE5             (1 << 28) /* Bit 28: Pre-FA ECC Errors (DCMLCE5) */
#define DCM_DCMLCS_DCMLCFE5            (1 << 29) /* Bit 29: Pre-FA Flash Memory Error Check (DCMLCFE5) */
                                                 /* Bits 30-31: Reserved */

/* DCM Miscellaneous (DCMMISC) */

                                                 /* Bits 0-9: Reserved */
#define DCM_DCMMISC_DCMDBGT            (1 << 10) /* Bit 10: DBG Section Error (DCMDBGT) */
#define DCM_DCMMISC_DCMDBGE            (1 << 11) /* Bit 11: DCM ECC error on DBG sections (DCMDBGE) */
                                                 /* Bits 12-27: Reserved */
#define DCM_DCMMISC_DCMCERS            (1 << 28) /* Bits 28: DCF Client Errors (DCMCERS) */
                                                 /* Bit 29: Reserved */
#define DCM_DCMMISC_MRKLSTRCHK         (1 << 30) /* Bit 30: MRK Local Storage Check (MRKLSTRCHK) */
                                                 /* Bit 31: Reserved */

/* Debug Status and Configuration (DCMDEB) */

                                                 /* Bit 0: Reserved */
#define DCM_DCMDEB_DCM_APPDBG_STAT     (1 << 1)  /* Bit 1: DCM Authentication Engine Status (DCM_APPDBG_STAT) */
                                                 /* Bits 2-15: Reserved */
#define DCM_DCMDEB_APPDBG_STAT_SOC     (1 << 16) /* Bit 16: Application Debug Status (APPDBG_STAT_SOC) */
                                                 /* Bits 17-31: Reserved */

/* DCF Error Count (DCMEC) */

#define DCM_DCMEC_DCMECT_SHIFT         (0)       /* Bits 0-15: Error Count (DCMECT) */
#define DCM_DCMEC_DCMECT_MASK          (0xffff << DCM_DCMEC_DCMECT_SHIFT)
                                                 /* Bits 16-31: Reserved */

/* DCF Scan Report (DCMSRRn) */

#define DCM_DCMSSR_DCMDCFE_SHIFT       (0)       /* Bits 0-20: Flash Memory Address (DCMDCFE1) */
#define DCM_DCMSSR_DCMDCFE_MASK        (0x1fffff << DCM_DCMSSR1_DCMDCFE1_SHIFT)
                                                 /* Bits 21-23: Reserved */
#define DCM_DCMSSR_DCMDCFF_SHIFT       (24)      /* Bits 24-26: DCF Record Location (DCMDCFF1) */
#define DCM_DCMSSR_DCMDCFF_MASK        (0x1fffff << DCM_DCMSSR1_DCMDCFE1_SHIFT)
#define DCM_DCMSSR_DCMESF              (1 << 27) /* Bit 27: Flash Memory Error (DCMESF1) */
#define DCM_DCMSSR_DCMESD              (1 << 28) /* Bit 28: Chip Side Error (DCMESD1) */
#define DCM_DCMSSR_DCMDCFT             (1 << 29) /* Bit 29: Scanning Timeout On Flash Memory (DCMDCFT1) */
                                                 /* Bit 30-31: Reserved */

/* LC Scan Status 2 (DCMLCS2) */

#define DCM_DCMLCS2_DCMLCSS6           (1 << 0)  /* Bit 0: FA Scan Status (DCMLCSS6) */
#define DCM_DCMLCS2_DCMLCC6_SHIFT      (1)       /* Bits 1-3: FA Marking (DCMLCC6) */
#define DCM_DCMLCS2_DCMLCC6_MASK       (0x07 << DCM_DCMLCS2_DCMLCC6_SHIFT)
#  define DCM_DCMLCS2_DCMLCC6_NOSCAN   (0x00 << DCM_DCMLCS2_DCMLCC6_SHIFT) /* Not scanned yet */
#  define DCM_DCMLCS2_DCMLCC6_ACTIVE   (0x01 << DCM_DCMLCS2_DCMLCC6_SHIFT) /* Marked as active */
#  define DCM_DCMLCS2_DCMLCC6_INACTIVE (0x02 << DCM_DCMLCS2_DCMLCC6_SHIFT) /* Marked as inactive */
#  define DCM_DCMLCS2_DCMLCC6_ERASED   (0x03 << DCM_DCMLCS2_DCMLCC6_SHIFT) /* Region is erased/virgin */
#  define DCM_DCMLCS2_DCMLCC6_UNKNOWN  (0x05 << DCM_DCMLCS2_DCMLCC6_SHIFT) /* Marked as inactive by an unknown pattern */
#  define DCM_DCMLCS2_DCMLCC6_TIMEOUT  (0x06 << DCM_DCMLCS2_DCMLCC6_SHIFT) /* Scanning timed out */

