apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_dcm.h
#define DCM_DCMLCS2_DCMLCE6            (1 << 4)  /* Bit 4: FA ECC Errors (DCMLCE6) */
#define DCM_DCMLCS2_DCMLCFE6           (1 << 5)  /* Bit 5: Flash Memory Error Check (DCMLCFE6) */
                                                 /* Bits 6-31: Reserved */

/* Read Only GPR On Destructive Reset Register 1 (DCMROD1) */

#define DCM_GPR_DCMROD1_PCU_ISO_STATUS    (1 << 0)  /* Bit 0: PCU Input Isolation status on previous standb entry (PCU_ISO_STATUS) */
#define DCM_GPR_DCMROD1_HSE_DCF_VIO       (1 << 1)  /* Bit 1: DCF violation from HSE (HSE_DCF_VIO) */
#define DCM_GPR_DCMROD1_KEY_RESP_READY    (1 << 2)  /* Bit 2: Key Response Ready (KEY_RESP_READY) */
                                                    /* Bits 3-31: Reserved */

/* Read Only GPR On Destructive Reset Register 3 (DCMROD3) */

#define DCM_GPR_DCMROD3_CM7_0_LOCKUP      (1 << 0)  /* Bit 0: CM7_0 Core Lockup Status (CM7_0_LOCKUP) */
#define DCM_GPR_DCMROD3_CM7_1_LOCKUP      (1 << 1)  /* Bit 0: CM7_1 Core Lockup Status (CM7_1_LOCKUP) */
#define DCM_GPR_DCMROD3_HSE_LOCKUP        (1 << 2)  /* Bit 2: HSE Core Lockup Status (HSE_LOCKUP) */
#define DCM_GPR_DCMROD3_CM7_RCCU1_ALARM   (1 << 3)  /* Bit 3: Cortex M7 Cores Lockstep Error Status (CM7_RCCU1_ALARM) */
#define DCM_GPR_DCMROD3_CM7_RCCU2_ALARM   (1 << 4)  /* Bit 4: Cortex M7 Cores Redundant Lockstep Error Status (CM7_RCCU2_ALARM) */
#define DCM_GPR_DCMROD3_TCM_GSKT_ALARM    (1 << 5)  /* Bit 5: TCM IAHB Gasket Monitor Alarm Status (TCM_GSKT_ALARM) */

#define DCM_GPR_DCMROD3_DMA_SYS_GSKT_ALARM    (1 << 6) /* Bit 6: Status of IAHB gasket safety alarm from DMA system AXBS IAHB gasket (DMA_SYS_GSKT_ALARM) */
#define DCM_GPR_DCMROD3_DMA_PERIPH_GSKT_ALARM (1 << 7) /* Bit 7: Status of IAHB gasket safety alarm from DMA periph AXBS IAHB gasket (DMA_PERIPH_GSKT_ALARM) */

#define DCM_GPR_DCMROD3_SYS_AXBS_ALARM    (1 << 8)  /* Bit 8: System AXBS Safety Alarm Status (SYS_AXBS_ALARM) */
#define DCM_GPR_DCMROD3_DMA_AXBS_ALARM    (1 << 9)  /* Bit 9: DMA AXBS_Lite Safety Alarm Status (DMA_AXBS_ALARM) */
                                                    /* Bit 10: Reserved */
#define DCM_GPR_DCMROD3_HSE_GSKT_ALARM    (1 << 11) /* Bit 11: HSE IAHB Gasket Alarm Status (HSE_GSKT_ALARM) */
#define DCM_GPR_DCMROD3_QSPI_GSKT_ALARM   (1 << 12) /* Bit 12: QSPI IAHB Gasket Alarm Status (QSPI_GSKT_ALARM) */
#define DCM_GPR_DCMROD3_AIPS1_GSKT_ALARM  (1 << 13) /* Bit 13: AIPS1 IAHB Gasket Alarm Status (AIPS1_GSKT_ALARM) */
#define DCM_GPR_DCMROD3_AIPS2_GSKT_ALARM  (1 << 14) /* Bit 14: AIPS2 IAHB Gasket Alarm Status (AIPS2_GSKT_ALARM) */
#define DCM_GPR_DCMROD3_ADDR_EDC_ERR      (1 << 15) /* Bit 15: Status of integrity error on addresses for safety (ADDR_EDC_ERR) */
#define DCM_GPR_DCMROD3_DATA_EDC_ERR      (1 << 16) /* Bit 16: Status of integrity error on data for safety (DATA_EDC_ERR) */
#define DCM_GPR_DCMROD3_TCM_AXBS_ALARM    (1 << 17) /* Bit 17: TCM AHB Splitter Safety Alarm Status (TCM_AXBS_ALARM) */
#define DCM_GPR_DCMROD3_EMAC_GSKT_ALARM   (1 << 18) /* Bit 18: EMAC IAHB Gasket Alarm Status (EMAC_GSKT_ALARM) */
#define DCM_GPR_DCMROD3_PERIPH_AXBS_ALARM (1 << 19) /* Bit 19: PERIPH AXBS_Lite Safety Alarm Status (PERIPH_AXBS_ALARM) */
                                                    /* Bits 20-21: Reserved */
#define DCM_GPR_DCMROD3_LC_ERR            (1 << 22) /* Bit 22: Error in Lifecycle Scanning (LC_ERR) */
                                                    /* Bit 23: Reserved */
#define DCM_GPR_DCMROD3_PRAM1_ECC_ERR     (1 << 24) /* Bit 24: Multi bit ECC error from SRAM1 (PRAM1_ECC_ERR) */
#define DCM_GPR_DCMROD3_PRAM0_ECC_ERR     (1 << 25) /* Bit 25: Multi bit ECC error from SRAM0 (PRAM0_ECC_ERR) */

#define DCM_GPR_DCMROD3_CM7_0_DCDATA_ECC_ERR (1 << 26) /* Bit 26: Multi bit ECC error from CM7_0 DCache data memory (CM7_0_DCDATA_ECC_ERR) */
#define DCM_GPR_DCMROD3_CM7_1_DCDATA_ECC_ERR (1 << 27) /* Bit 27: Multi bit ECC error from CM7_1 DCache data memory (CM7_1_DCDATA_ECC_ERR) */
#define DCM_GPR_DCMROD3_CM7_0_DCTAG_ECC_ERR  (1 << 28) /* Bit 28: Multi bit ECC error from CM7_0 DCache tag memory (CM7_0_DCTAG_ECC_ERR) */
#define DCM_GPR_DCMROD3_CM7_1_DCTAG_ECC_ERR  (1 << 29) /* Bit 29: Multi bit ECC error from CM7_1 DCache tag memory (CM7_1_DCTAG_ECC_ERR) */
#define DCM_GPR_DCMROD3_CM7_0_ICDATA_ECC_ERR (1 << 30) /* Bit 30: Multi bit ECC error from CM7_0 ICache data memory (CM7_0_ICDATA_ECC_ERR) */
#define DCM_GPR_DCMROD3_CM7_1_ICDATA_ECC_ERR (1 << 31) /* Bit 31: Multi bit ECC error from CM7_1 ICache data memory (CM7_1_ICDATA_ECC_ERR) */

/* Read Only GPR On Destructive Reset Register 4 (DCMROD4) */

#define DCM_GPR_DCMROD4_CM7_0_ICTAG_ECC_ERR (1 << 0) /* Bit 0: Multi bit ECC error from CM7_0 ICache tag memory (CM7_0_ICTAG_ECC_ERR) */
#define DCM_GPR_DCMROD4_CM7_1_ICTAG_ECC_ERR (1 << 1) /* Bit 1: Multi bit ECC error from CM7_1 ICache tag memory (CM7_1_ICTAG_ECC_ERR) */
#define DCM_GPR_DCMROD4_CM7_0_ITCM_ECC_ERR  (1 << 2) /* Bit 2: Uncorrectable ECC error reported from CM7_0 Instruction TCM memory (CM7_0_ITCM_ECC_ERR) */
#define DCM_GPR_DCMROD4_CM7_0_DTCM0_ECC_ERR (1 << 3) /* Bit 3: Uncorrectable ECC error reported from CM7_0 Data TCM memory block 0 (CM7_0_DTCM0_ECC_ERR) */
#define DCM_GPR_DCMROD4_CM7_0_DTCM1_ECC_ERR (1 << 4) /* Bit 4: Uncorrectable ECC error reported from CM7_1 Data TCM memory block 1 (CM7_0_DTCM1_ECC_ERR) */
#define DCM_GPR_DCMROD4_CM7_1_ITCM_ECC_ERR  (1 << 5) /* Bit 5: Uncorrectable ECC error reported from CM7_1 Instruction TCM memory (CM7_1_ITCM_ECC_ERR) */
#define DCM_GPR_DCMROD4_CM7_1_DTCM0_ECC_ERR (1 << 6) /* Bit 6: Uncorrectable ECC error reported from CM7_1 Data TCM memory block 0 (CM7_1_DTCM0_ECC_ERR) */
#define DCM_GPR_DCMROD4_CM7_1_DTCM1_ECC_ERR (1 << 7) /* Bit 7: Uncorrectable ECC error reported from CM7_1 Data TCM memory block 1 (CM7_1_DTCM1_ECC_ERR) */
#define DCM_GPR_DCMROD4_DMA_TCD_RAM_ECC_ERR (1 << 8) /* Bit 8: Uncorrectable ECC error reported from DMA_TCD memory (DMA_TCD_RAM_ECC_ERR) */

#define DCM_GPR_DCMROD4_PRAM0_FCCU_ALARM  (1 << 9)  /* Bit 9: Status of PRAM0 safety alarm (PRAM0_FCCU_ALARM) */
#define DCM_GPR_DCMROD4_PRAM1_FCCU_ALARM  (1 << 10) /* Bit 10: Status of PRAM1 safety alarm (PRAM1_FCCU_ALARM) */
#define DCM_GPR_DCMROD4_HSE_RAM_ECC_ERR   (1 << 11) /* Bit 11: HSE RAM Uncorrectable ECC status (HSE_RAM_ECC_ERR) */
#define DCM_GPR_DCMROD4_PF0_CODE_ECC_ERR  (1 << 12) /* Bit 12: Flash0 Code ECC Uncorrectable Error (PF0_CODE_ECC_ERR) */
#define DCM_GPR_DCMROD4_PF0_DATA_ECC_ERR  (1 << 13) /* Bit 13: Flash0 Data ECC Uncorrectable Error (PF0_DATA_ECC_ERR) */
#define DCM_GPR_DCMROD4_PF1_CODE_ECC_ERR  (1 << 14) /* Bit 14: Flash1 Code ECC Uncorrectable Error (PF1_CODE_ECC_ERR) */
#define DCM_GPR_DCMROD4_PF1_DATA_ECC_ERR  (1 << 15) /* Bit 15: Flash1 Data ECC Uncorrectable Error (PF1_DATA_ECC_ERR) */
#define DCM_GPR_DCMROD4_PF2_CODE_ECC_ERR  (1 << 16) /* Bit 16: Flash2 Code ECC Uncorrectable Error (PF2_CODE_ECC_ERR) */
#define DCM_GPR_DCMROD4_PF2_DATA_ECC_ERR  (1 << 17) /* Bit 17: Flash2 Data ECC Uncorrectable Error (PF2_DATA_ECC_ERR) */
#define DCM_GPR_DCMROD4_FLASH_EDC_ERR     (1 << 18) /* Bit 18: Status of flash ECC correction error through EDC reported by FMU (FLASH_EDC_ERR) */

