apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_dcm.h
#define DCM_GPR_DCMROD4_FLASH_ADDR_ENC_ERR (1 << 19) /* Bit 19: Flash Address Encode Error (FLASH_ADDR_ENC_ERR) */

#define DCM_GPR_DCMROD4_FLASH_REF_ERR     (1 << 20) /* Bit 20: Flash reference current loss or read voltage error while previous read(s) (FLASH_REF_ERR) */
#define DCM_GPR_DCMROD4_FLASH_RST_ERR     (1 << 21) /* Bit 21: Flash Reset Error Status (FLASH_RST_ERR) */
#define DCM_GPR_DCMROD4_FLASH_SCAN_ERR    (1 << 22) /* Bit 22: Error while DCM flash scanning process due to invalid data (FLASH_SCAN_ERR) */
                                                    /* Bit 23: Reserved */
#define DCM_GPR_DCMROD4_FLASH_ECC_ERR     (1 << 24) /* Bit 24: ECC Error from Flash Controller (FLASH_ECC_ERR) */
#define DCM_GPR_DCMROD4_FLASH_ACCESS_ERR  (1 << 25) /* Bit 25: Transaction Monitor Mismatch Error from Flash Controller (FLASH_ACCESS_ERR) */
#define DCM_GPR_DCMROD4_VDD1P1_GNG_ERR    (1 << 26) /* Bit 26: Go/no-go indicator for VDD1PD1 (double bond) supply going to PLL (VDD1P1_GNG_ERR) */
#define DCM_GPR_DCMROD4_VDD2P5_GNG_ERR    (1 << 27) /* Bit 27: Go/no-go indicator for VDD_HV_FLA (double bond) supply going to FXOSC and PLL (VDD2P5_GNG_ERR) */
                                                    /* Bit 28: Reserved */

#define DCM_GPR_DCMROD4_TEST_ACTIVATION_0_ERR (1 << 29) /* Bit 29: Accidental Partial Test Activation (TEST_ACTIVATION_0_ERR) */
#define DCM_GPR_DCMROD4_TEST_ACTIVATION_1_ERR (1 << 30) /* Bit 30: Accidental Partial Test Activation (TEST_ACTIVATION_1_ERR) */

                                                    /* Bit 31: Reserved */

/* Read Only GPR On Destructive Reset Register 5 (DCMROD5) */

                                                    /* Bit 0: Reserved */
#define DCM_GPR_DCMROD5_INTM_0_ERR        (1 << 1)  /* Bit 1: Interrupt monitor0 error reported by INTM (INTM_0_ERR) */
#define DCM_GPR_DCMROD5_INTM_1_ERR        (1 << 2)  /* Bit 2: Interrupt monitor1 error reported by INTM (INTM_0_ERR) */
#define DCM_GPR_DCMROD5_INTM_2_ERR        (1 << 3)  /* Bit 3: Interrupt monitor2 error reported by INTM (INTM_0_ERR) */
#define DCM_GPR_DCMROD5_INTM_3_ERR        (1 << 4)  /* Bit 4: Interrupt monitor3 error reported by INTM (INTM_0_ERR) */
#define DCM_GPR_DCMROD5_SW_NCF_0          (1 << 5)  /* Bit 5: Status of DCMRWF1[FCCU_SW_NCF0] (SW_NCF_0) */
#define DCM_GPR_DCMROD5_SW_NCF_1          (1 << 6)  /* Bit 6: Status of DCMRWF1[FCCU_SW_NCF1] (SW_NCF_1) */
#define DCM_GPR_DCMROD5_SW_NCF_2          (1 << 7)  /* Bit 7: Status of DCMRWF1[FCCU_SW_NCF2] (SW_NCF_2) */
#define DCM_GPR_DCMROD5_SW_NCF_3          (1 << 8)  /* Bit 8: Status of DCMRWF1[FCCU_SW_NCF3] (SW_NCF_3) */
#define DCM_GPR_DCMROD5_STCU_NCF          (1 << 9)  /* Bit 9: STCU non-critical fault / BIST result error (STCU_NCF) */

#define DCM_GPR_DCMROD5_MBIST_ACTIVATION_ERR (1 << 10) /* Bit 10: Indicates an accidental backdoor access on memories (MBIST_ACTIVATION_ERR) */

#define DCM_GPR_DCMROD5_STCU_BIST_USER_CF (1 << 11) /* Bit 11: L/M BIST enabled accidentally (STCU_BIST_USER_CF) */
#define DCM_GPR_DCMROD5_MTR_BUS_ERR       (1 << 12) /* Bit 12: Fault reported due to illegal access on MTR (MTR_BUS_ERR) */

#define DCM_GPR_DCMROD5_DEBUG_ACTIVATION_ERR (1 << 13) /* Bit 13: Monitoring of unintended debug activation (DEBUG_ACTIVATION_ERR) */

#define DCM_GPR_DCMROD5_TCM_RDATA_EDC_ERR (1 << 14) /* Bit 14: Integrity (EDC) error on TCM read data for safety (TCM_RDATA_EDC_ERR) */

#define DCM_GPR_DCMROD5_EMAC_RDATA_EDC_ERR (1 << 15) /* Bit 15: Integrity (EDC) error on EMAC read data for safety (EMAC_RDATA_EDC_ERR) */

                                                    /* Bit 16: Reserved */
#define DCM_GPR_DCMROD5_DMA_RDATA_EDC_ERR (1 << 17) /* Bit 17: Integrity (EDC) error on eDMA read data for safety (DMA_RDATA_EDC_ERR) */

#define DCM_GPR_DCMROD5_CM7_1_AHBP_RDATA_EDC_ERR (1 << 18) /* Bit 18: Integrity error on CM7_1 peripheral read data for safety (CM7_1_AHBP_RDATA_EDC_ERR) */
#define DCM_GPR_DCMROD5_CM7_1_AHBM_RDATA_EDC_ERR (1 << 19) /* Bit 19: Integrity error on CM7_1 main read data for safety (CM7_1_AHBM_RDATA_EDC_ERR) */
#define DCM_GPR_DCMROD5_CM7_0_AHBP_RDATA_EDC_ERR (1 << 20) /* Bit 18: Integrity error on CM7_0 peripheral read data for safety (CM7_0_AHBP_RDATA_EDC_ERR) */
#define DCM_GPR_DCMROD5_CM7_0_AHBM_RDATA_EDC_ERR (1 << 21) /* Bit 19: Integrity error on CM7_0 main read data for safety (CM7_0_AHBM_RDATA_EDC_ERR) */

#define DCM_GPR_DCMROD5_HSE_RDATA_EDC_ERR (1 << 22) /* Bit 22: Integrity (EDC) error on HSE read data for safety (HSE_RDATA_EDC_ERR) */
                                                    /* Bits 23-31: Reserved */

/* Read Only GPR On Functional Reset Register 1 (DCMROF1) */

#define DCM_GPR_DCMROF1_EMAC_MDC_CHID_0   (1 << 0)  /* Bit 0: EMAC DMA Channel ID0 Status (EMAC_MDC_CHID_0) */
#define DCM_GPR_DCMROF1_EMAC_MDC_CHID_1   (1 << 1)  /* Bit 1: EMAC DMA Channel ID0 Status (EMAC_MDC_CHID_0) */
                                                    /* Bits 2-31: Reserved */

/* Read Only GPR On Functional Reset Register n (DCMROFn, n=2..17) */

#define DCM_GPR_DCMROF2_17_DCF_SDID_SHIFT (0)       /* Bits 0-31: Configuration bits of DCF client SDID x (DCF_SDIDx) */
#define DCM_GPR_DCMROF2_17_DCF_SDID_MASK  (0xffffffff << DCM_GPR_DCMROF2_17_DCF_SDID_SHIFT)

/* Read Only GPR On Functional Reset Register 19 (DCMROF19) */

                                                    /* Bits 0-28: Reserved */
#define DCM_GPR_DCMROF19_LOCKSTEP_EN      (1 << 29) /* Bit 29: Lockstep Enable (LOCKSTEP_EN) */
#define DCM_GPR_DCMROF19_DCM_DONE         (1 << 30) /* Bit 30: DCM Done (DCM_DONE) */

#define DCM_GPR_DCMROF19_FCCU_EOUT_DEDICATED (1 << 31) /* Bit 31: FCCU EOUT Dedicated (FCCU_EOUT_DEDICATED) */

/* Read Only GPR On Functional Reset Register 20 (DCMROF20) */

#define DCM_GPR_DCMROF20_POR_WDG_EN       (1 << 0)  /* Bit 0: Indicates the status of POR_WDG as configured in DCF record (POR_WDG_EN) */
#define DCM_GPR_DCMROF20_LMAUTO_DIS       (1 << 1)  /* Bit 1: PMC last mile automatic crossover from boot regulation feature support (LMAUTO_DIS) */
#define DCM_GPR_DCMROF20_CM7_TCM_WS_EN    (1 << 2)  /* Bit 2: Status of CM7 DTCM and ITCM waitstates as configured in DCF record (CM7_TCM_WS_EN) */

#define DCM_GPR_DCMROF20_DMA_AXBS_IAHB_BYP (1 << 3) /* Bit 3: Status of DMA AXBS IAHB gasket as configured in DCF record (DMA_AXBS_IAHB_BYP) */
                                                    /* Bit 4: Reserved */
#define DCM_GPR_DCMROF20_QSPI_IAHB_BYP    (1 << 5)  /* Bit 5: Status of QSPI IAHB gasket as configured in DCF record (QSPI_IAHB_BYP) */
#define DCM_GPR_DCMROF20_AIPS_IAHB_BYP    (1 << 6)  /* Bit 6: Status of AIPS1/2 IAHB gasket as configured in DCF record (AIPS_IAHB_BYP) */
                                                    /* Bits 7-17: Reserved */

#define DCM_GPR_DCMROF20_DCF_DEST_RST_ESC_SHIFT (18) /* Bits 18-31: Destructive Reset Escalation (DCF_DEST_RST_ESC) */
#define DCM_GPR_DCMROF20_DCF_DEST_RST_ESC_MASK  (0x3fff << DCM_GPR_DCMROF20_DCF_DEST_RST_ESC_SHIFT)
#  define DCM_GPR_DCMROF20_DCF_DEST_RST_ESC_DIS (0x0000 << DCM_GPR_DCMROF20_DCF_DEST_RST_ESC_SHIFT) /* Destructive Reset Escalation disabled */
#  define DCM_GPR_DCMROF20_DCF_DEST_RST_ESC_EN  (0x0001 << DCM_GPR_DCMROF20_DCF_DEST_RST_ESC_SHIFT) /* Destructive Rest Escalation enabled */

/* Read Only GPR On Functional Reset Register 21 (DCMROF21) */

