apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_dcm.h
#define DCM_GPR_DCMROF21_DCF_DEST_RST_ESC_SHIFT (0) /* Bits 0-17: Destructive Reset Escalation (DCF_DEST_RST_ESC) */
#define DCM_GPR_DCMROF21_DCF_DEST_RST_ESC_MASK  (0x03ffff << DCM_GPR_DCMROF21_DCF_DEST_RST_ESC_SHIFT)
#  define DCM_GPR_DCMROF21_DCF_DEST_RST_ESC_DIS (0x000000 << DCM_GPR_DCMROF21_DCF_DEST_RST_ESC_SHIFT) /* Destructive Reset Escalation disabled */
#  define DCM_GPR_DCMROF21_DCF_DEST_RST_ESC_EN  (0x000001 << DCM_GPR_DCMROF21_DCF_DEST_RST_ESC_SHIFT) /* Destructive Rest Escalation enabled */

                                                    /* Bit 18: Reserved */

#define DCM_GPR_DCMROF21_HSE_CLK_MODE_OPTION_SHIFT  (19) /* Bits 19-20: HSE Clock Mode Option (HSE_CLK_MODE_OPTION) */
#define DCM_GPR_DCMROF21_HSE_CLK_MODE_OPTION_MASK   (0x03 << DCM_GPR_DCMROF21_HSE_CLK_MODE_OPTION_SHIFT)
#  define DCM_GPR_DCMROF21_HSE_CLK_MODE_OPTION_A    (0x00 << DCM_GPR_DCMROF21_HSE_CLK_MODE_OPTION_SHIFT) /* Applicable for clocking option A */
#  define DCM_GPR_DCMROF21_HSE_CLK_MODE_OPTION_CDEF (0x01 << DCM_GPR_DCMROF21_HSE_CLK_MODE_OPTION_SHIFT) /* Applicable for clocking options C, D, E, E2 and F */
#  define DCM_GPR_DCMROF21_HSE_CLK_MODE_OPTION_B    (0x02 << DCM_GPR_DCMROF21_HSE_CLK_MODE_OPTION_SHIFT) /* Applicable for clocking option B */

/* Read Write GPR On Power On Reset Register 1 (DCMRWP1) */

                                                    /* Bits 0-2: Reserved */
#define DCM_GPR_DCMRWP1_CLKOUT_STANDBY    (1 << 3)  /* Bit 3: Clockout standby expose over functional and destructive reset (CLKOUT_STANDBY) */
                                                    /* Bits 4-7: Reserved */
#define DCM_GPR_DCMRWP1_STANDBY_PWDOG_DIS (1 << 8)  /* Bit 8: Disables the standby entry and exit monitoring window of the POR WDOG (STANDBY_PWDOG_DIS) */

#define DCM_GPR_DCMRWP1_POR_WDOG_TRIM_SHIFT    (9)  /* Bits 9-10: Trims for POR WDG timeout value (POR_WDOG_TRIM) */
#define DCM_GPR_DCMRWP1_POR_WDOG_TRIM_MASK     (0x03 << DCM_GPR_DCMRWP1_POR_WDOG_TRIM_SHIFT)
#  define DCM_GPR_DCMRWP1_POR_WDOG_TRIM_6_25MS (0x00 << DCM_GPR_DCMRWP1_POR_WDOG_TRIM_SHIFT) /* POR WDOG Timeout = 06.25ms */
#  define DCM_GPR_DCMRWP1_POR_WDOG_TRIM_12_5MS (0x01 << DCM_GPR_DCMRWP1_POR_WDOG_TRIM_SHIFT) /* POR WDOG Timeout = 12.50ms */
#  define DCM_GPR_DCMRWP1_POR_WDOG_TRIM_25MS   (0x02 << DCM_GPR_DCMRWP1_POR_WDOG_TRIM_SHIFT) /* POR WDOG Timeout = 25.00ms */
#  define DCM_GPR_DCMRWP1_POR_WDOG_TRIM_50MS   (0x03 << DCM_GPR_DCMRWP1_POR_WDOG_TRIM_SHIFT) /* POR WDOG Timeout = 50.00ms */

                                                    /* Bits 11-31: Reserved */

/* Read Write GPR On Power On Reset Register 3 (DCMRWP3) */

                                                    /* Bits 0-8: Reserved */
#define DCM_GPR_DCMRWP3_DEST_RST9_AS_IPI  (1 << 9)  /* Bit 9: Configures a destructive reset to interrupt (DEST_RST9_AS_IPI) */
                                                    /* Bits 10-31: Reserved */

/* Read Write GPR On Destructive Reset Register 2 (DCMRWD2) */

                                                    /* Bits 0-6: Reserved */

#define DCM_GPR_DCMRWD2_EOUT_STAT_DUR_STEST (1 << 7) /* Bit 7: Controls the EOUT state during selftest (EOUT_STAT_DUR_STEST) */

                                                    /* Bits 8-31: Reserved */

/* Read Write GPR On Destructive Reset Register 3 (DCMRWD3) */

#define DCM_GPR_DCMRWD3_CM7_0_LOCKUP_EN   (1 << 0)  /* Bit 0: Enable fault monitoring at FCCU NCF 0 for CM7_0 core lockup (CM7_0_LOCKUP_EN) */
#define DCM_GPR_DCMRWD3_CM7_1_LOCKUP_EN   (1 << 1)  /* Bit 1: Enable fault monitoring at FCCU NCF 0 for CM7_1 core lockup (CM7_1_LOCKUP_EN) */
                                                    /* Bit 2: Reserved */
#define DCM_GPR_DCMRWD3_CM7_RCCU1_ALARM_EN (1 << 3) /* Bit 3: Enable fault monitoring at FCCU NCF 0 for Cortex M7 cores lockstep error (CM7_RCCU1_ALARM_EN) */
#define DCM_GPR_DCMRWD3_CM7_RCCU2_ALARM_EN (1 << 4) /* Bit 4: Enable fault monitoring at FCCU NCF 0 for Cortex M7 cores redundant lockstep error (CM7_RCCU2_ALARM_EN) */

#define DCM_GPR_DCMRWD3_TCM_GSKT_ALARM_EN (1 << 5)  /* Bit 5: Enable fault monitoring at FCCU NCF 1 for TCM IAHB Gasket monitor alarm (TCM_GSKT_ALRM_EN) */

#define DCM_GPR_DCMRWD3_DMA_SYS_GSKT_ALARM_EN    (1 << 6) /* Bit 6: Enable fault monitoring at FCCU NCF 1 for IAHB gasket safety alarm from DMA system AXBS IAHB gasket (DMA_SYS_GSKT_ALARM_EN) */
#define DCM_GPR_DCMRWD3_DMA_PERIPH_GSKT_ALARM_EN (1 << 7) /* Bit 7: Enable fault monitoring at FCCU NCF 1 for IAHB gasket safety alarm from DMA periph AXBS IAHB gasket (DMA_PERIPH_GSKT_ALARM_EN) */

#define DCM_GPR_DCMRWD3_SYS_AXBS_ALARM_EN (1 << 8)  /* Bit 8: Enable fault monitoring at FCCU NCF 1 for system AXBS safety alarm (SYS_AXBS_ALARM_EN) */
#define DCM_GPR_DCMRWD3_DMA_AXBS_ALARM_EN (1 << 9)  /* Bit 9: Enable fault monitoring at FCCU NCF 1 for DMA AXBS_Lite safety alarm (DMA_AXBS_ALARM_EN) */
                                                    /* Bit 10: Reserved */
#define DCM_GPR_DCMRWD3_HSE_GSKT_ALARM_EN (1 << 11) /* Bit 11: Enable fault monitoring at FCCU NCF 1 for HSE IAHB gasket alarm (HSE_GSKT_ALARM_EN) */

#define DCM_GPR_DCMRWD3_QSPI_GSKT_ALARM_EN  (1 << 12) /* Bit 12: Enable fault monitoring at FCCU NCF 1 for QSPI IAHB gasket alarm (QSPI_GSKT_ALARM_EN) */
#define DCM_GPR_DCMRWD3_AIPS1_GSKT_ALARM_EN (1 << 13) /* Bit 13: Enable fault monitoring at FCCU NCF 1 for AIPS1 IAHB gasket alarm (AIPS1_GSKT_ALARM_EN) */
#define DCM_GPR_DCMRWD3_AIPS2_GSKT_ALARM_EN (1 << 14) /* Bit 14: Enable fault monitoring at FCCU NCF 1 for AIPS2 IAHB gasket alarm (AIPS2_GSKT_ALARM_EN) */

#define DCM_GPR_DCMRWD3_ADDR_EDC_ERR_EN   (1 << 15) /* Bit 15: Enable fault monitoring at FCCU NCF 1 for integrity error on address for safety (ADDR_EDC_ERR_EN) */
#define DCM_GPR_DCMRWD3_DATA_EDC_ERR_EN   (1 << 16) /* Bit 16: Enable fault monitoring at FCCU NCF 1 for integrity error on data for safety (DATA_EDC_ERR_EN) */
#define DCM_GPR_DCMRWD3_TCM_AXBS_ALARM_EN (1 << 17) /* Bit 17: Enable fault monitoring at FCCU NCF 1 for TCM AHB splitter safety alarm (TCM_AXBS_ALARM_EN) */

#define DCM_GPR_DCMRWD3_EMAC_GSKT_ALARM_EN   (1 << 18) /* Bit 18: Enable fault monitoring at FCCU NCF 1 for EMAC IAHB gasket alarm (EMAC_GSKT_ALARM_EN) */
#define DCM_GPR_DCMRWD3_PERIPH_AXBS_ALARM_EN (1 << 19) /* Bit 19: Enable fault monitoring at FCCU NCF 1 for PERIPH AXBS_Lite safety alarm (PERIPH_AXBS_ALARM_EN) */

                                                    /* Bits 20-21: Reserved */
#define DCM_GPR_DCMRWD3_LC_ERR_EN         (1 << 22) /* Bit 22: Enable fault monitoring at FCCU NCF 3 for error in lifecycle scanning (LC_ERR_EN) */
                                                    /* Bits 23: Reserved */

#define DCM_GPR_DCMRWD3_PRAM1_ECC_ERR_EN  (1 << 24) /* Bit 24: Enable fault monitoring at FCCU NCF 2 for multi bit ECC error from SRAM1 (PRAM1_ECC_ERR_EN) */
#define DCM_GPR_DCMRWD3_PRAM0_ECC_ERR_EN  (1 << 25) /* Bit 25: Enable fault monitoring at FCCU NCF 2 for multi bit ECC error from SRAM0 (PRAM0_ECC_ERR_EN) */

