apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_dcm.h
#define DCM_GPR_DCMRWD8_RTC_DBG_DIS_CM7_1 (1 << 7)  /* Bit 7: RTC debug disable bit for CM7_1 (RTC_DBG_DIS_CM7_1) */

#define DCM_GPR_DCMRWD8_SWT0_DBG_DIS_CM7_1 (1 << 8) /* Bit 8: SWT0 debug disable bit for CM7_1 (SWT0_DBG_DIS_CM7_1) */
#define DCM_GPR_DCMRWD8_SWT1_DBG_DIS_CM7_1 (1 << 9) /* Bit 9: SWT1 debug disable bit for CM7_1 (SWT1_DBG_DIS_CM7_1) */

#define DCM_GPR_DCMRWD8_STM0_DBG_DIS_CM7_1     (1 << 10) /* Bit 10: STM0 debug disable bit for CM7_1 (STM0_DBG_DIS_CM7_1) */
#define DCM_GPR_DCMRWD8_STM1_DBG_DIS_CM7_1     (1 << 11) /* Bit 11: STM1 debug disable bit for CM7_1 (STM1_DBG_DIS_CM7_1) */
#define DCM_GPR_DCMRWD8_PIT0_DBG_DIS_CM7_1     (1 << 12) /* Bit 12: PIT0 debug disable bit for CM7_1 (PIT0_DBG_DIS_CM7_1) */
#define DCM_GPR_DCMRWD8_PIT1_DBG_DIS_CM7_1     (1 << 13) /* Bit 13: PIT1 debug disable bit for CM7_1 (PIT1_DBG_DIS_CM7_1) */
#define DCM_GPR_DCMRWD8_PIT2_DBG_DIS_CM7_1     (1 << 14) /* Bit 14: PIT2 debug disable bit for CM7_1 (PIT2_DBG_DIS_CM7_1) */
#define DCM_GPR_DCMRWD8_LPSPI0_DBG_DIS_CM7_1   (1 << 15) /* Bit 15: LPSPI0 debug disable bit for CM7_1 (LPSPI0_DBG_DIS_CM7_1) */
#define DCM_GPR_DCMRWD8_LPSPI1_DBG_DIS_CM7_1   (1 << 16) /* Bit 16: LPSPI1 debug disable bit for CM7_1 (LPSPI1_DBG_DIS_CM7_1) */
#define DCM_GPR_DCMRWD8_LPSPI2_DBG_DIS_CM7_1   (1 << 17) /* Bit 17: LPSPI2 debug disable bit for CM7_1 (LPSPI2_DBG_DIS_CM7_1) */
#define DCM_GPR_DCMRWD8_LPSPI3_DBG_DIS_CM7_1   (1 << 18) /* Bit 18: LPSPI3 debug disable bit for CM7_1 (LPSPI3_DBG_DIS_CM7_1) */
#define DCM_GPR_DCMRWD8_LPSPI4_DBG_DIS_CM7_1   (1 << 19) /* Bit 19: LPSPI4 debug disable bit for CM7_1 (LPSPI4_DBG_DIS_CM7_1) */
#define DCM_GPR_DCMRWD8_LPSPI5_DBG_DIS_CM7_1   (1 << 20) /* Bit 20: LPSPI5 debug disable bit for CM7_1 (LPSPI5_DBG_DIS_CM7_1) */
#define DCM_GPR_DCMRWD8_LPI2C0_DBG_DIS_CM7_1   (1 << 21) /* Bit 21: LPI2C0 debug disable bit for CM7_1 (LPI2C0_DBG_DIS_CM7_1) */
#define DCM_GPR_DCMRWD8_LPI2C1_DBG_DIS_CM7_1   (1 << 22) /* Bit 22: LPI2C1 debug disable bit for CM7_1 (LPI2C1_DBG_DIS_CM7_1) */
#define DCM_GPR_DCMRWD8_FLEXIO_DBG_DIS_CM7_1   (1 << 23) /* Bit 23: FLEXIO debug disable bit for CM7_1 (FLEXIO_DBG_DIS_CM7_1) */
#define DCM_GPR_DCMRWD8_FLEXCAN0_DBG_DIS_CM7_1 (1 << 24) /* Bit 24: FLEXCAN0 debug disable bit for CM7_1 (FLEXCAN0_DBG_DIS_CM7_1) */
#define DCM_GPR_DCMRWD8_FLEXCAN1_DBG_DIS_CM7_1 (1 << 25) /* Bit 25: FLEXCAN1 debug disable bit for CM7_1 (FLEXCAN1_DBG_DIS_CM7_1) */
#define DCM_GPR_DCMRWD8_FLEXCAN2_DBG_DIS_CM7_1 (1 << 26) /* Bit 26: FLEXCAN2 debug disable bit for CM7_1 (FLEXCAN2_DBG_DIS_CM7_1) */
#define DCM_GPR_DCMRWD8_FLEXCAN3_DBG_DIS_CM7_1 (1 << 27) /* Bit 27: FLEXCAN3 debug disable bit for CM7_1 (FLEXCAN3_DBG_DIS_CM7_1) */
#define DCM_GPR_DCMRWD8_FLEXCAN4_DBG_DIS_CM7_1 (1 << 28) /* Bit 28: FLEXCAN4 debug disable bit for CM7_1 (FLEXCAN4_DBG_DIS_CM7_1) */
#define DCM_GPR_DCMRWD8_FLEXCAN5_DBG_DIS_CM7_1 (1 << 29) /* Bit 29: FLEXCAN5 debug disable bit for CM7_1 (FLEXCAN5_DBG_DIS_CM7_1) */
#define DCM_GPR_DCMRWD8_SAI0_DBG_DIS_CM7_1     (1 << 30) /* Bit 30: SAI0 debug disable bit for CM7_1 (SAI0_DBG_DIS_CM7_1) */
#define DCM_GPR_DCMRWD8_SAI1_DBG_DIS_CM7_1     (1 << 31) /* Bit 31: SAI1 debug disable bit for CM7_1 (SAI1_DBG_DIS_CM7_1) */

/* Read Write GPR On Destructive Reset Register 9 (DCMRWD9) */

#define DCM_GPR_DCMRWD9_I3C_DBG_DIS_CM7_1 (1 << 0)  /* Bit 0: I3C debug disable bit for CM7_1 (I3C_DBG_DIS_CM7_1) */
                                                    /* Bits 1-31: Reserved */

/* Read Write GPR On Functional Reset Register 1 (DCMRWF1) */

#define DCM_GPR_DCMRWF1_CAN_TIMESTAMP_SEL        (1 << 0) /* Bit 0: Select between EMAC and STM for CAN timestamping (CAN_TIMESTAMP_SEL) */
#  define DCM_GPR_DCMRWF1_CAN_TIMESTAMP_SEL_EMAC (1 << 0) /*        EMAC selected for CAN timestamping */
#  define DCM_GPR_DCMRWF1_CAN_TIMESTAMP_SEL_STM0 (1 << 1) /*        STM0 selected for CAN timestamping */

#define DCM_GPR_DCMRWF1_CAN_TIMESTAMP_EN  (1 << 1)  /* Bit 1: Enables CAN timestamping feature for all FlexCANs (CAN_TIMESTAMP_EN) */
#define DCM_GPR_DCMRWF1_FCCU_SW_NCF0      (1 << 2)  /* Bit 2: Control to initiate Software NFC to FCCU (FCCU_SW_NFC0) */
#define DCM_GPR_DCMRWF1_FCCU_SW_NCF1      (1 << 3)  /* Bit 3: Control to initiate Software NFC to FCCU (FCCU_SW_NFC1) */
#define DCM_GPR_DCMRWF1_FCCU_SW_NCF2      (1 << 4)  /* Bit 4: Control to initiate Software NFC to FCCU (FCCU_SW_NFC2) */
#define DCM_GPR_DCMRWF1_FCCU_SW_NCF3      (1 << 5)  /* Bit 5: Control to initiate Software NFC to FCCU (FCCU_SW_NFC3) */
                                                    /* Bit 6: Reserved */

#define DCM_GPR_DCMRWF1_RMII_MII_SEL        (1 << 7) /* Bit 7: Selects between MII and RMII mode of ethernet (RMII_MII_SEL) */
#  define DCM_GPR_DCMRWF1_RMII_MII_SEL_MII  (0 << 7) /*        MII mode */
#  define DCM_GPR_DCMRWF1_RMII_MII_SEL_RMII (1 << 7) /*        RMII mode */

                                                    /* Bits 8-14: Reserved */

#define DCM_GPR_DCMRWF1_VDD_HV_B_IO_CTRL_LATCH (1 << 15) /* Bit 15: Controls the IO controls latching in low frequency RUN mode to reduce power consumption on VDD_HV_B domain pins (VDD_HV_B_IO_CTRL_LATCH) */

#define DCM_GPR_DCMRWF1_STANDBY_IO_CONFIG (1 << 16) /* Bit 16: Controls the IO state in standby mode (STANDBY_IO_CONFIG) */
                                                    /* Bits 17-19: Reserved */
#define DCM_GPR_DCMRWF1_SUPPLY_MON_EN     (1 << 20) /* Bit 20: Enable the supply voltage monitoring by ADC (SUPPLY_MON_SEL) */

#define DCM_GPR_DCMRWF1_SUPPLY_MON_SEL_SHIFT  (21)  /* Bits 21-23: Selects the source of voltage used by ADC for supply monitoring (SUPPLY_MON_SEL) */
#define DCM_GPR_DCMRWF1_SUPPLY_MON_SEL_MASK   (0x07 << DCM_GPR_DCMRWF1_SUPPLY_MON_SEL_SHIFT)
#  define DCM_GPR_DCMRWF1_SUPPLY_MON_SEL_HV_A (0x00 << DCM_GPR_DCMRWF1_SUPPLY_MON_SEL_SHIFT) /* VDD_HV_A_DIV */
#  define DCM_GPR_DCMRWF1_SUPPLY_MON_SEL_HV_B (0x01 << DCM_GPR_DCMRWF1_SUPPLY_MON_SEL_SHIFT) /* VDD_HV_B_DIV */
#  define DCM_GPR_DCMRWF1_SUPPLY_MON_SEL_1_5  (0x02 << DCM_GPR_DCMRWF1_SUPPLY_MON_SEL_SHIFT) /* VDD_1.5_DIV */
#  define DCM_GPR_DCMRWF1_SUPPLY_MON_SEL_2_5  (0x03 << DCM_GPR_DCMRWF1_SUPPLY_MON_SEL_SHIFT) /* VDD_2.5_OSC */
#  define DCM_GPR_DCMRWF1_SUPPLY_MON_SEL_HOT  (0x04 << DCM_GPR_DCMRWF1_SUPPLY_MON_SEL_SHIFT) /* VDD1.1_PD1_HOT_POINT */
#  define DCM_GPR_DCMRWF1_SUPPLY_MON_SEL_COLD (0x05 << DCM_GPR_DCMRWF1_SUPPLY_MON_SEL_SHIFT) /* VDD1.1_PD1_COLD_POINT */
#  define DCM_GPR_DCMRWF1_SUPPLY_MON_SEL_PLL  (0x06 << DCM_GPR_DCMRWF1_SUPPLY_MON_SEL_SHIFT) /* VDD1.1_PLL */
#  define DCM_GPR_DCMRWF1_SUPPLY_MON_SEL_PD0  (0x07 << DCM_GPR_DCMRWF1_SUPPLY_MON_SEL_SHIFT) /* VDD1.1_PD0 */

#define DCM_GPR_DCMRWF1_VSS_LV_ANMUX_EN   (1 << 24) /* Bit 24: Enable VSS_LV monitoring (VSS_LV_ANMUX_EN) */

#define DCM_GPR_DCMRWF1_VDD_HV_A_VLT_DVDR_EN (1 << 25) /* Bit 25: Enable 2:1 divider for VDD_HV_A for supply voltage monitoring by ADC (VDD_HV_A_VLT_DVDR_EN) */
#define DCM_GPR_DCMRWF1_VDD_HV_B_VLT_DVDR_EN (1 << 26) /* Bit 26: Enable 2:1 divider for VDD_HV_B for supply voltage monitoring by ADC (VDD_HV_B_VLT_DVDR_EN) */
#define DCM_GPR_DCMRWF1_VDD_1_5_VLT_DVDR_EN  (1 << 27) /* Bit 27: Enable 2:1 divider for VDD1P5 for supply voltage monitoring by ADC (VDD_1_5_VLT_DVDR_EN) */

                                                    /* Bits 28-31: Reserved */

/* Read Write GPR On Functional Reset Register 2 (DCMRWF2) */

                                                    /* Bits 0-2: Reserved */

#define DCM_GPR_DCMRWF2_DCM_SCAN_BYP_STDBY_EXT         (1 << 3) /* Bit 3: Bypass the DCM scanning on standby exit (DCM_SCAN_BYP_STDBY_EXT) */
#define DCM_GPR_DCMRWF2_FIRC_TRIM_BYP_STDBY_EXT        (1 << 4) /* Bit 4: Bypass the FIRC trimming on standby exit (FIRC_TRIM_BYP_STDBY_EXT) */
#define DCM_GPR_DCMRWF2_PMC_TRIM_RGM_DCF_BYP_STDBY_EXT (1 << 5) /* Bit 5: Bypass the PMC trimming and RGM DCF loading on standby exit (PMC_TRIM_RGM_DCF_BYP_STDBY_EXT) */
#define DCM_GPR_DCMRWF2_SIRC_TRIM_BYP_STDBY_EXT        (1 << 6) /* Bit 6: Bypass the SIRC trimming on standby exit (SIRC_TRIM_BYP_STDBY_EXT) */

                                                    /* Bits 7-15: Reserved */
#define DCM_GPR_DCMRWF2_HSE_GSKT_BYPASS   (1 << 16) /* Enable the HSE IAHB gasket bypass out of standby mode (HSE_GSKT_BYPASS) */
                                                    /* Bits 17-31: Reserved */

/* Read Write GPR On Functional Reset Register 4 (DCMRWF4) */

                                                    /* Bit 0: Reserved */

