apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_dcm.h
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S8  (1 << 1) /* Bit 1: Selects GPIO45 to drive ADC0_S8 (MUX_MODE_EN_ADC0_S8) */
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S9  (1 << 2) /* Bit 2: Selects GPIO46 to drive ADC0_S9 (MUX_MODE_EN_ADC0_S9) */
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S14 (1 << 3) /* Bit 3: Selects GPIO32 to drive ADC1_S14 (MUX_MODE_EN_ADC1_S14) */
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S15 (1 << 4) /* Bit 4: Selects GPIO33 to drive ADC1_S15 (MUX_MODE_EN_ADC1_S15) */
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S22 (1 << 5) /* Bit 5: Selects GPIO114 to drive ADC1_S22 (MUX_MODE_EN_ADC1_S22) */
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S23 (1 << 6) /* Bit 6: Selects GPIO115 to drive ADC1_S23 (MUX_MODE_EN_ADC1_S23) */

                                                    /* Bits 7-8: Reserved */

#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC2_S8  (1 << 9)  /* Bit 9: Selects GPIO45 to drive ADC2_S8 (MUX_MODE_EN_ADC2_S8) */
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC2_S9  (1 << 10) /* Bit 10: Selects GPIO46 to drive ADC2_S9 (MUX_MODE_EN_ADC2_S9) */

                                                    /* Bits 11-12: Reserved */

#define DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN0_BYP (1 << 13) /* Bit 13: Bypass glitch filter on TRGMUX input63 (GLITCH_FIL_TRG_IN0_BYP) */
#define DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN1_BYP (1 << 14) /* Bit 14: Bypass glitch filter on TRGMUX input62 (GLITCH_FIL_TRG_IN1_BYP) */
#define DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN2_BYP (1 << 15) /* Bit 15: Bypass glitch filter on TRGMUX input61 (GLITCH_FIL_TRG_IN2_BYP) */
#define DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN3_BYP (1 << 16) /* Bit 16: Bypass glitch filter on TRGMUX input60 (GLITCH_FIL_TRG_IN3_BYP) */

#define DCM_GPR_DCMRWF4_CM7_0_CPUWAIT     (1 << 17) /* Bit 17: Put CM7_0 core into wait mode (CM7_0_CPUWAIT) */
#define DCM_GPR_DCMRWF4_CM7_1_CPUWAIT     (1 << 18) /* Bit 18: Put CM7_1 core into wait mode (CM7_1_CPUWAIT) */
                                                    /* Bits 19-31: Reserved */

/* Read Write GPR On Functional Reset Register 5 (DCMRWF5) */

#define DCM_GPR_DCMRWF5_BOOT_MODE          (1 << 0) /* Bit 0: Selects the boot mode after exiting standby mode (BOOT_MODE) */
#  define DCM_GPR_DCMRWF5_BOOT_MODE_NORMAL (0 << 0) /*        Normal */
#  define DCM_GPR_DCMRWF5_BOOT_MODE_FAST   (1 << 0) /*        Fast Standby */

#define DCM_GPR_DCMRWF5_BOOT_ADDRESS_SHIFT (1)      /* Bits 1-31: Cortex-M7_0 base address of vector table to be used after exiting (fast) standby mode (BOOT_ADDRESS) */
#define DCM_GPR_DCMRWF5_BOOT_ADDRESS_MASK  (0x7fffffff << DCM_GPR_DCMRWF5_BOOT_ADDRESS_SHIFT)

/* Read Only GPR On PMCPOR Reset Register 1 (DCMROPP1) */

#define DCM_GPR_DCMROPP1_POR_WDG_STAT0    (1 << 0)  /* Bit 0: Status of functional reset sequence process FUNC0 when POR_WDG overflows (POR_WDG_STAT0) */
#define DCM_GPR_DCMROPP1_POR_WDG_STAT1    (1 << 1)  /* Bit 1: Status of functional reset sequence process FUNC1 when POR_WDG overflows (POR_WDG_STAT1) */
#define DCM_GPR_DCMROPP1_POR_WDG_STAT2    (1 << 2)  /* Bit 2: Status of functional reset sequence process FUNC2 when POR_WDG overflows (POR_WDG_STAT2) */
#define DCM_GPR_DCMROPP1_POR_WDG_STAT3    (1 << 3)  /* Bit 3: Status of functional reset sequence process FUNC3 when POR_WDG overflows (POR_WDG_STAT3) */
#define DCM_GPR_DCMROPP1_POR_WDG_STAT4    (1 << 4)  /* Bit 4: Status of functional reset sequence process FUNC4 when POR_WDG overflows (POR_WDG_STAT4) */
#define DCM_GPR_DCMROPP1_POR_WDG_STAT5    (1 << 5)  /* Bit 5: Status of functional reset sequence process FUNC5 when POR_WDG overflows (POR_WDG_STAT5) */
#define DCM_GPR_DCMROPP1_POR_WDG_STAT6    (1 << 6)  /* Bit 6: Status of functional reset sequence process FUNC6 when POR_WDG overflows (POR_WDG_STAT6) */
                                                    /* Bits 7-9: Reserved */
#define DCM_GPR_DCMROPP1_POR_WDG_STAT10   (1 << 10) /* Bit 10: Status of functional reset sequence process FUNC7 when POR_WDG overflows (POR_WDG_STAT10) */
#define DCM_GPR_DCMROPP1_POR_WDG_STAT11   (1 << 11) /* Bit 11: Status of functional reset sequence process FUNC8 when POR_WDG overflows (POR_WDG_STAT11) */
                                                    /* Bits 12-13: Reserved */
#define DCM_GPR_DCMROPP1_POR_WDG_STAT14   (1 << 14) /* Bit 14: Status of functional reset sequence process FUNC9 when POR_WDG overflows (POR_WDG_STAT14) */
                                                    /* Bits 15-16: Reserved */
#define DCM_GPR_DCMROPP1_POR_WDG_STAT17   (1 << 17) /* Bit 17: Status of functional reset sequence process FUNC10 when POR_WDG overflows (POR_WDG_STAT17) */
                                                    /* Bits 18-19: Reserved */
#define DCM_GPR_DCMROPP1_POR_WDG_STAT20   (1 << 20) /* Bit 20: Status of functional reset sequence process DEST0 when POR_WDG overflows (POR_WDG_STAT20) */
                                                    /* Bits 21-28: Reserved */
#define DCM_GPR_DCMROPP1_POR_WDG_STAT29   (1 << 29) /* Bit 29: Status of standby entry request initiated by MC_ME when POR_WDG overflows (POR_WDG_STAT29) */
#define DCM_GPR_DCMROPP1_POR_WDG_STAT30   (1 << 30) /* Bit 30: Status of standby exit acknowledgement by MC_PCU when POR_WDG overflows (POR_WDG_STAT30) */
#define DCM_GPR_DCMROPP1_POR_WDG_STAT31   (1 << 31) /* Bit 31: MC_RGM reset event (if occurred) while the device is in STANDBY mode (POR_WDG_STAT31) */

/* Read Only GPR On PMCPOR Reset Register 2 (DCMROPP2) */

#define DCM_GPR_DCMROPP2_POR_WDG_STAT32   (1 << 0)  /* Bit 0: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT32) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT33   (1 << 1)  /* Bit 1: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT33) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT34   (1 << 2)  /* Bit 2: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT34) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT35   (1 << 3)  /* Bit 3: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT35) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT36   (1 << 4)  /* Bit 4: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT36) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT37   (1 << 5)  /* Bit 5: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT37) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT38   (1 << 6)  /* Bit 6: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT38) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT39   (1 << 7)  /* Bit 7: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT39) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT40   (1 << 8)  /* Bit 8: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT40) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT41   (1 << 9)  /* Bit 9: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT41) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT42   (1 << 10) /* Bit 10: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT42) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT43   (1 << 11) /* Bit 11: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT43) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT44   (1 << 12) /* Bit 12: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT44) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT45   (1 << 13) /* Bit 13: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT45) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT46   (1 << 14) /* Bit 14: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT46) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT47   (1 << 15) /* Bit 15: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT47) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT48   (1 << 16) /* Bit 16: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT48) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT49   (1 << 17) /* Bit 17: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT49) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT50   (1 << 18) /* Bit 18: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT50) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT51   (1 << 19) /* Bit 19: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT51) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT52   (1 << 20) /* Bit 20: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT52) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT53   (1 << 21) /* Bit 21: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT53) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT54   (1 << 22) /* Bit 22: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT54) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT55   (1 << 23) /* Bit 23: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT55) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT56   (1 << 24) /* Bit 24: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT56) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT57   (1 << 25) /* Bit 25: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT57) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT58   (1 << 26) /* Bit 26: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT58) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT59   (1 << 27) /* Bit 27: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT59) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT60   (1 << 28) /* Bit 28: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT60) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT61   (1 << 29) /* Bit 29: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT61) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT62   (1 << 30) /* Bit 30: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT62) */
#define DCM_GPR_DCMROPP2_POR_WDG_STAT63   (1 << 31) /* Bit 31: MC_RGM functional/external event status register when POR_WDG overflows (POR_WDG_STAT63) */

/* Read Only GPR On PMCPOR Reset Register 3 (DCMROPP3) */

#define DCM_GPR_DCMROPP3_POR_WDG_STAT64   (1 << 0)  /* Bit 0: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT64) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT65   (1 << 1)  /* Bit 1: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT65) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT66   (1 << 2)  /* Bit 2: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT66) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT67   (1 << 3)  /* Bit 3: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT67) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT68   (1 << 4)  /* Bit 4: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT68) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT69   (1 << 5)  /* Bit 5: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT69) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT70   (1 << 6)  /* Bit 6: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT70) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT71   (1 << 7)  /* Bit 7: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT71) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT72   (1 << 8)  /* Bit 8: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT72) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT73   (1 << 9)  /* Bit 9: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT73) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT74   (1 << 10) /* Bit 10: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT74) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT75   (1 << 11) /* Bit 11: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT75) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT76   (1 << 12) /* Bit 12: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT76) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT77   (1 << 13) /* Bit 13: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT77) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT78   (1 << 14) /* Bit 14: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT78) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT79   (1 << 15) /* Bit 15: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT79) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT80   (1 << 16) /* Bit 16: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT80) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT81   (1 << 17) /* Bit 17: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT81) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT82   (1 << 18) /* Bit 18: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT82) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT83   (1 << 19) /* Bit 19: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT83) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT84   (1 << 20) /* Bit 20: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT84) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT85   (1 << 21) /* Bit 21: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT85) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT86   (1 << 22) /* Bit 22: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT86) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT87   (1 << 23) /* Bit 23: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT87) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT88   (1 << 24) /* Bit 24: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT88) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT89   (1 << 25) /* Bit 25: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT89) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT90   (1 << 26) /* Bit 26: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT90) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT91   (1 << 27) /* Bit 27: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT91) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT92   (1 << 28) /* Bit 28: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT92) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT93   (1 << 29) /* Bit 29: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT93) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT94   (1 << 30) /* Bit 30: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT94) */
#define DCM_GPR_DCMROPP3_POR_WDG_STAT95   (1 << 31) /* Bit 31: MC_RGM destructive event status register when POR_WDG overflows (POR_WDG_STAT95) */

/* Read Only GPR On PMCPOR Reset Register 4 (DCMROPP4) */

#define DCM_GPR_DCMROPP4_POR_WDG_STAT96   (1 << 0) /* Bit 0: POR_WDG reset event if POR_WDG initiates a POR sequence (POR_WDG_STAT96) */
                                                   /* Bits 1-31: Reserved */

#endif /* __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_DCM_H */
